# x = 7
# if x == 5: # false
#     print("я не сработаю)")
# elif x > 5:
#     print("x > 5 🤓")
# else: # если не сработает if/elif
#     print("я сработаю)))")
# word_1 = input("Введи слово (1/2):")
# word_2 = input("Введи слово (1/2):")
# word_1 = word_1.lower()
# word_2 = word_2.lower()
# if word_1.isalpha() and word_2.isalpha():
#     sorted_w1 = sorted(word_1)
#     sorted_w2 = sorted(word_2)
#     print(sorted_w1)
#     print(sorted_w2)
#     if sorted_w1 == sorted_w2:
#         print("ураа у тебя анаграмма")
#     else:
#         print("Ну ты даешь конечно...")
# else:
#     print("я букАвки хочу))")
# q1 = input("сколько будет 2+2?\n"
#            "a) 4, б) 5\n"
#            "-->")
# if q1 == "a" or q1 == "4":
#     print("маладес))")
# else:
#     print("одна ошибка и ты апельсин!")
#     quit()
# q2 = input("Арбуз - это (с ботанической точки зрения)..?\n"
#            "а) корнеплод, б) фрукт, в)дольче милк, г)ягода.\n"
#            "-->")
# if q2 == "г":
#     print("маладес))")
# else:
#     print("одна ошибка и ты апельсин!")
#     quit()
# q3 = input("Что такое цуцванг?\n"
#            "a) положение в шашках и шахматах, в котором любой ход игрока ведёт к ухудшению его позиции.\n"
#            "б) порода обезьян\n"
#            "в) аниме в честь егора\n")
# if q3 == "a":
#     print("маладес))")
# elif q3 == "в":
#     print("Партия гордится тобой. Плюс второй порция миска рис")
# else:
#     print("одна ошибка и ты апельсин!")
#     quit()
# print("Ты МААААНДАААринка")

